{
    "profile": {
        "name": "Ji-Hoon Kim",
        "title": "Senior Frontend Engineer",
        "photo": "https://images.unsplash.com/photo-1672685667592-0392f458f46f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3Nzg4Nzd8MHwxfHNlYXJjaHwxfHxwcm9mZXNzaW9uYWwlMjBoZWFkc2hvdCUyMHBvcnRyYWl0fGVufDF8fHx8MTc2NTQyNjYxMnww&ixlib=rb-4.1.0&q=80&w=1080",
        "email": "jihoon.dev@example.com",
        "phone": "+82 10-1234-5678",
        "location": "Seoul, South Korea",
        "linkedin": "linkedin.com/in/jihoon-dev",
        "github": "github.com/jihoon-dev",
        "website": "jihoon.dev"
    },
    "summary": "Product-minded Software Engineer with 6+ years of experience specializing in building scalable web applications with React, TypeScript, and Node.js. Proven track record of improving site performance by 40% and leading cross-functional teams to deliver critical features. Passionate about UI/UX consistency, accessibility, and engineering efficiency. Experienced in mentoring junior developers and driving technical decisions in fast-paced startup environments.",
    "experience": [
        {
            "company": "Tech Startup Inc.",
            "location": "San Francisco, CA (Remote)",
            "role": "Senior Frontend Engineer",
            "period": "Jan 2022 – Present",
            "achievements": [
                "Spearheaded the migration of a legacy monolithic architecture to a <strong>Next.js micro-frontend system</strong>, reducing build times by 60% and enabling independent deployments for 3 squads.",
                "Optimized core landing page Web Vitals, improving <strong>LCP from 2.5s to 0.8s</strong>, which directly contributed to a 15% increase in user conversion rates and SEO rankings.",
                "Designed and implemented a comprehensive <strong>Design System</strong> using Radix UI and Tailwind CSS, standardizing UI components across 4 distinct products and reducing UI-related bugs by 30%.",
                "Mentored 2 junior developers, conducting code reviews and weekly pair programming sessions to foster engineering best practices and clean code architecture.",
                "Led the accessibility initiative (WCAG 2.1 AA), ensuring the product is usable by a wider audience and mitigating potential legal risks."
            ]
        },
        {
            "company": "Global E-commerce Ltd.",
            "location": "Seoul, South Korea",
            "role": "Software Engineer",
            "period": "Jun 2019 – Dec 2021",
            "achievements": [
                "Developed and maintained the checkout flow handling <strong>$1M+ in daily transaction volume</strong>, achieving 99.99% uptime during peak Black Friday traffic.",
                "Integrated third-party payment gateways (Stripe, PayPal) and implemented a robust error handling system, reducing payment failures by 20% and improving customer trust.",
                "Collaborated closely with product managers and designers to implement A/B tests that led to a 5% uplift in average order value (AOV).",
                "Wrote comprehensive E2E tests using Cypress, increasing code coverage from 40% to 85% and significantly reducing regression bugs in the critical payment path.",
                "Refactored legacy Redux state management to use React Query, simplifying data fetching logic and reducing boilerplate code by 40%."
            ]
        },
        {
            "company": "Creative Agency",
            "location": "Seoul, South Korea",
            "role": "Frontend Developer",
            "period": "Mar 2017 – May 2019",
            "achievements": [
                "Built responsive, pixel-perfect websites for 10+ clients using React and SCSS, ensuring cross-browser compatibility down to IE11.",
                "Automated image optimization pipelines using Gulp/Webpack, reducing total page weight by an average of 30% and improving load times on mobile networks.",
                "Developed interactive promotional pages for major brand campaigns, incorporating complex GSAP animations to enhance user engagement."
            ]
        },
        {
            "company": "University Lab",
            "location": "Seoul, South Korea",
            "role": "Undergraduate Research Assistant",
            "period": "Sep 2016 – Feb 2017",
            "achievements": [
                "Assisted in developing a web-based data visualization tool for analyzing large-scale sensor data using D3.js.",
                "Optimized database queries for MySQL, reducing data retrieval time for visualization rendering by 50%."
            ]
        }
    ],
    "projects": [
        {
            "name": "Real-time Collaboration Dashboard",
            "link": "#",
            "year": "2023",
            "techStack": "React, WebSocket, Node.js, Redis, Docker",
            "descriptions": [
                "Built a real-time analytics dashboard supporting 500+ concurrent connections using WebSockets and Redis Pub/Sub for instant data updates.",
                "Implemented role-based access control (RBAC) to ensure data security across different user levels."
            ]
        },
        {
            "name": "Open Source Contribution: React UI Library",
            "link": "#",
            "year": "2022",
            "techStack": "React, TypeScript, Jest",
            "descriptions": [
                "Contributed to a popular React UI component library by fixing a critical memory leak in the Modal component.",
                "Added unit tests to cover edge cases, improving the overall reliability of the library for 10k+ weekly users."
            ]
        },
        {
            "name": "Mobile Expense Tracker App",
            "link": "#",
            "year": "2021",
            "techStack": "React Native, Firebase, Redux",
            "descriptions": [
                "Developed and deployed a cross-platform mobile application for tracking personal expenses, acquiring 1,000+ active users.",
                "Implemented offline capability using local storage and background sync, allowing users to add expenses without internet connection."
            ]
        }
    ],
    "activities": [
        "<strong>Speaker at FE Conf Korea 2023</strong> – \"Scaling Frontend Architecture with Micro-frontends\".",
        "<strong>Medium Blog</strong> – Authored 20+ articles on React performance optimization and TypeScript best practices, accumulating 50k+ views.",
        "<strong>Best Employee of the Year</strong> (Global E-commerce Ltd.) – Recognized for outstanding contribution to the payment system stability (2020).",
        "<strong>1st Place, Seoul Tech Hackathon</strong> – Built an AI-powered accessibility tool for visually impaired users in 48 hours (2019)."
    ],
    "education": [
        {
            "school": "Korea University",
            "degree": "Bachelor of Science in Computer Science",
            "period": "Mar 2013 – Feb 2017"
        },
        {
            "school": "University of California, Berkeley",
            "degree": "Exchange Student, Computer Science",
            "period": "Aug 2015 – May 2016"
        }
    ]
}